meeting/minutes/2022/11-29.org
:PROPERTIES:
:ID:       5759136C-4C91-45D3-9B62-176B01AB69EC
:END:
#+title: QT4 CG Meeting 013 Minutes 2022-11-29
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [1/4]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-013-01: MK to refine the coercion rules with respect to enumeration types
+ [ ] QT4CG-013-02: DN to provide a concrete example of the function case discussed with respect to coercion rules.
+ [X] QT4CG-013-03: MK to raise a separate issue about sequence/array out-of-bounds handling
  + https://github.com/qt4cg/qtspecs/issues/278

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [8/13]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets BTW, JL

+ [ ] Anthony (Tony) Bufort (AB)
+ [X] Reece Dunn (RD) [0:30-]
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [0:10-]
+ [X] Michael Kay (MK)
+ [ ] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP)
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/11-29.html][the agenda]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2022/12-06.html][is scheduled for Tuesday, 6 December]].

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/11-22.html][the minutes of the previous meeting]].

Accepted.

** Review of open action items [7/8]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
  + Continued
+ [X] QT4CG-012-01: MK to add a reference to the place in XSD where it says that value spaces are non-overlapping
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-02: MK to point out the rules for union types are actually a bit more complex than described in section 2.2.1.
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-03: MK to consider introducing schema element and schema element in 2.8
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-04: MK to add “and also of other specific function types” to 2.8.
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-05: NW to see if the presentation of the type hierarchy tables can be improved.
  + See [[https://qt4cg.org/dashboard/#pr-268][pull request #268]]
+ [X] QT4CG-012-06: MK to remove ~xs:untyped~ from the paragraph at the top of 2.8.2
  + See [[https://qt4cg.org/dashboard/#pr-271][pull request #271]]
+ [X] QT4CG-012-07: NW to work with MK to sort out the server build issues with PR #237
  + Resolved, merged
+ [X] QT4CG-012-08: NW to put the coercion rule changes on the agenda next week.

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

