meeting/minutes/2022/11-29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 013 Minutes 2022-11-29</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 013 Minutes 2022-11-29</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[1/4]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[7/8]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#coercion">2.1. Review the coercion rules</a></li>
<li><a href="#pr-fn-foot">2.2. Review pull request #250: fn:foot, etc.</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./12-06.html">at meeting 014</a> on 6 December 2022.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[1/4]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-013-01: MK to refine the coercion rules with respect to enumeration types</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-013-02: DN to provide a concrete example of the function case discussed with respect to coercion rules.</li>
<li class="on"><code>[X]</code> QT4CG-013-03: MK to raise a separate issue about sequence/array out-of-bounds handling
<ul class="org-ul">
<li><a href="https://github.com/qt4cg/qtspecs/issues/278">https://github.com/qt4cg/qtspecs/issues/278</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets BTW, JL
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD) [0:30-]</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [0:10-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/11-29.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/12-06.html">is scheduled for Tuesday, 6 December</a>.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/11-22.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[7/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
<ul class="org-ul">
<li>Continued</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-01: MK to add a reference to the place in XSD where it says that value spaces are non-overlapping
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-02: MK to point out the rules for union types are actually a bit more complex than described in section 2.2.1.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-03: MK to consider introducing schema element and schema element in 2.8
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-04: MK to add “and also of other specific function types” to 2.8.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-05: NW to see if the presentation of the type hierarchy tables can be improved.
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-268">pull request #268</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-06: MK to remove <code>xs:untyped</code> from the paragraph at the top of 2.8.2
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-271">pull request #271</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-07: NW to work with MK to sort out the server build issues with PR #237
<ul class="org-ul">
<li>Resolved, merged</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-012-08: NW to put the coercion rule changes on the agenda next week.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
