meeting/minutes/2022/11-29.html

<div id="outline-container-coercion" class="outline-3">
<h3 id="coercion"><span class="section-number-3">2.1.</span> Review the coercion rules</h3>
<div class="outline-text-3" id="text-coercion">
<p>
See <a href="https://qt4cg.org/specifications/xquery-40/xpath-40.html#id-coercion-rules">4.4.3 Coercion Rules</a> in <a href="https://qt4cg.org/specifications/xquery-40/xpath-40.html">XPath 4.0</a>
</p>

<p>
See also <a href="https://qt4cg.org/dashboard/#pr-254">pull request #254</a>
</p>

<p>
Mike walks us through the spec with the applied changes (the diff is a bit messy).
</p>

<ul class="org-ul">
<li>MK: Function conversion rules are renamed coercion rules
<ul class="org-ul">
<li>… Rules accept, coerce, or reject a supplied value</li>
<li>… (We’re reviewing the XQuery version, not the XPath version, so
there are no sections about backwards compatibility.)</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-013-01: MK to refine the coercion rules with respect to enumeration types
</p>

<p>
Mike walks through the rules in 4.4.3
</p>

<ul class="org-ul">
<li>MK: Rule 5 is new: relabels types. This allows you to use “5” where
xs:positiveInteger is expected without an explicit cast.
<ul class="org-ul">
<li>Relabeling is not the same as casting</li>
<li>Numeric promotion and relabeling are mutually exclusive.</li>
<li>The next rule is also new, it applies coercion to all the values of a map.</li>
<li>Then function coercion</li>
<li>Else error.</li>
<li>Function coercion has a new item 2 that says that if the function
you supply has a lower arity than the function that’s required,
then you wrap it in a function that ignores the excess arguments.
<ul class="org-ul">
<li>This lets callbacks that expect 1 argument to work with
functions that could have two.</li>
</ul></li>
</ul></li>
<li>DN: When talking about coercion, it seems to me that the way I read
it is that coercion applies only to the arguments, not the return
value.</li>
<li>MK: No, this section doesn’t say where coercion is used.</li>
<li>DN: It kind of implies it though. Maybe we need to have a more
explicit statement that it can be used for both.</li>
<li>MK: I wanted to avoid enumerating all the places where it’s used
because they’re subject to change.
<ul class="org-ul">
<li>… In places like, for example, dynamic function calls, we say that
the rules are applied to both the arguments and the return value.</li>
</ul></li>
<li>MSM: I think if you look at 4.4.1.2, that makes the context for the
term “supplied value” to make sense.</li>
<li>DN: It would still be good to be clear.</li>
<li>DN: When a function returns a function and the returned function has
to be passed arguments, when are the arguments coerced? Is it done
“early” or “late”? 
<ul class="org-ul">
<li>… If we know some arguments won’t be used at all, can we assume
that in this case, the arguments should not be evaluated “early”?</li>
</ul></li>
<li>MK: I’m not sure I understand exactly the scenario you’re
describing. This is a spec, not an implementation, so there’s plenty
of scope for optimization.</li>
<li>DN: It’s definitely explicit somewhere in this text, maybe we should
make sure it’s explicit in this case where a function that’s
returned with a smaller arity gets wrapped.</li>
<li>CG: If a function item is returned, then we have potential
paremeters, but no arguments.</li>
<li>DN: We have an expression; on the left side, the first thing that
happens is a funtion is returned, and then the rest of the
expression is the arguments for the function.</li>
<li>MK: Isn’t that just a simple optimization that implementations can
perform?</li>
<li>DN: We should clearly say in this case that it is possible not to
evaluate the arguments that are not going to be used.</li>
<li>NW: Can you provide an example in chat? We’re having trouble
following just verbally?</li>
<li>DN: Yes, but maybe not now.</li>
</ul>

<p>
Some further attempt to describe examples.
</p>

<p>
ACTION QT4CG-013-02: DN to provide a concrete example of the function case discussed with respect to coercion rules.
</p>

<ul class="org-ul">
<li>NW: I don’t think anyone thinks you should be forbidden from
throwing it away. Requiring it be thrown away might be possible.</li>
<li>MSM: I’d be a little nervous about a rule that says you are required
to throw away an “extra” argument because I view lazy or eager
evaluation as an optimization strategy.</li>
</ul>

<p>
MK draws our attention to another part of the spec.
</p>

<ul class="org-ul">
<li>MK: The coercion rules are also applied to variable bindings. In
4.15.1, there’s a new section that describes the coercion.
(So <code>let $temp as xs:double := 32.5</code> will succeed.)
<ul class="org-ul">
<li>… I proposed this before (years ago) and there was some objection
because variables and functions are different and should be
treated differently.</li>
<li>… I’ve looked at some other languages and there is some variation,
but there’s no reason to think this should be a problem. It works
fine in XSLT.</li>
</ul></li>
<li>MSM: Makes sense to me: functions and constants and variables are
all functions.</li>
</ul>

<p>
MSM draws our attention back to 4.4.3.
</p>

<ul class="org-ul">
<li>MSM: Can I come back to rule 5? In the Data Model, we’ve followed
the lead of XSD in saying the value spaces of the primitive types
are decreed to be distinct. That applies only to the primitive
types. What I think we’re saying here is the type coercion to a
subtype works if the required type and the label on the supplied
value are both descended from the same primitive type.</li>
<li>MK: Yes, essentially.</li>
<li>MSM: So this covers integer/positiveInteger but not decimal/double.MK</li>
<li>MK: Or hexBinary to base64binary.</li>
</ul>

<p>
Some chuckling about the way this played out in XSD.
</p>

<ul class="org-ul">
<li>MK: If we’re going to take advantage of this capability to change
standard functions, a function that expects an NCName for example,
what I’ve suggested is that we give ourselves the license to declare
the expected type as NCName and retain the error code if you give
something else. Rather than getting a generic type error, we have
the ability to define a more specific error code.</li>
<li>MSM: That seems to mean that that particular kind of type checking,
raising those errors, has to take place before the coercion and not
after it. The point of view has to be from outside the function.</li>
<li>MK: At the implementation level, there has to be some sort of secret
sauce in the function signature to identify the error code.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
