meeting/minutes/2022/11-29.org
** Review pull request #250: fn:foot, etc.
:PROPERTIES:
:CUSTOM_ID: pr-fn-foot
:END:

See [[https://qt4cg.org/dashboard/#pr-250][pull request #250]]

Mike walk us through the PR.

+ MK: This gives us four new functions: ~fn:foot~ and ~fn:truncate~
  and ~array:foot~ and ~array:truncate~. They’re the same except for
  error checking where they’re consistent with related functions.
+ JK: Do these qualify in the category of “convenience functions”?
+ MK: They certainly do fall into that category. It’s easy to code
  them up yourself.
  + … For convenience functions you have to weigh two factors: how
    many folks are going to use them and how many lines/how difficult
    it is. The ~fn:head~ function saves a lot of people a lot of code.
    The ~fn:foot~ function probably saves fewer people just a little bit more code.
  + … It also makes the code easier to read; the ~last()~ trick for
    ~fn:foot~ is harder to understand and harder to optimize.
+ JK: They’ll be great functions to have, I’m just thinking of the
  larger question of the “cluttering” of the core specs with
  convenience functions.

NW observes that the question of [[https://github.com/qt4cg/qtspecs/issues/274][issue #274]] isn’t on the agenda this
week, maybe it should be next week.

+ RD: One of the arguments against convenience functions is that it
  makes more work for implementors to claim conformance.
  + … I wonder if it would make sense to have a reference
    implementation for as many as we can, perhaps non-normatively.
+ EP: I was going to make exactly that point.
+ MSM: These functions do have those expressions.
+ RD: So we could pull that into a single place, grouped by XQuery and
  XSLT style.
+ MSM: A library that an implementation could just import.
+ DN: If the question is asked about ~fn:head~ and ~fn:tail~, I don’t
  think they’re convenience functions at all! They’re the basics for
  any recursive implementation. And that holds true for these
  functions as well as they’re the complement of those functions.
  + … I am still firmly agains the name ~fn:truncate~.
  + … I also don’t like the difference in behavior between the array
    and sequence versions. I proposed that for the sequence functions,
    we have an additional parameter that says whether an exception
    should be raised for an empty argument. The default value should
    be ~false()~, but a user who wants them to behave the same as
    arrays can set them to ~true()~.
+ RD: An extra argument to control exception behavior isn’t a great
  design decision. It pollutes the argument namespace. It would
  make more sense to use something like the XQuery declare options.
+ MK: A mode like “unordered”. Make it part of the static context.
+ CG: Whenever you work with arrays, you always have out-of-bounds
  issues, we shouldn’t restrict it to just these functions.
+ DN: There’s no way to make an array behave like a sequence. An array
  can contain an empty sequence and that makes the cases
  indistinguishable.
+ RD: Then what happens if you’re writing the function and you have
  one case where you’ve remembered to include that parameter and
  another where you’ve forgotten it. Your code is expecting it to
  throw, but because you left it out, it doens’t. That’s my objection
  to having this as a parameter on each of the non-array functions.
+ DN: I think this is completely new behavior, but you’re right, you
  have to specify it in every call.
+ RD: Having it at the global level would allow you to have more
  consistent control, so you don’t have to remember to pass the specific parameter.
+ DN: But there could be cases where I want them to work both ways.
+ RD: But by extension, why not parameters on every function?
+ CG: We should separate this discussion from these four functions,
  they apply much more widely.

Some discussion of what other functions have this behavior.

+ NW: Why not wrap the function you want to check in another function
  that checks?
+ MSM: That has the value of being shorter and easier to remember.

+ MK: What are the possible solutions?
  + Do nothing, leave it up to the user; try/catch
  + Add parameters to the functions
  + Provide mirror versions of the functions
  + Make it modal

+ DN: Try/catch is the least practical
+ MM: My choice is the proposal as it’s designed: sequences are designed to be relaxed, arrays are for stronger type hecking. That inconsist

ACTION QT4CG-013-03: MK to raise a separate issue about sequence/array out-of-bounds handling

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

