meeting/minutes/2022/11-29.html

<div id="outline-container-pr-fn-foot" class="outline-3">
<h3 id="pr-fn-foot"><span class="section-number-3">2.2.</span> Review pull request #250: fn:foot, etc.</h3>
<div class="outline-text-3" id="text-pr-fn-foot">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-250">pull request #250</a>
</p>

<p>
Mike walk us through the PR.
</p>

<ul class="org-ul">
<li>MK: This gives us four new functions: <code>fn:foot</code> and <code>fn:truncate</code>
and <code>array:foot</code> and <code>array:truncate</code>. They’re the same except for
error checking where they’re consistent with related functions.</li>
<li>JK: Do these qualify in the category of “convenience functions”?</li>
<li>MK: They certainly do fall into that category. It’s easy to code
them up yourself.
<ul class="org-ul">
<li>… For convenience functions you have to weigh two factors: how
many folks are going to use them and how many lines/how difficult
it is. The <code>fn:head</code> function saves a lot of people a lot of code.
The <code>fn:foot</code> function probably saves fewer people just a little bit more code.</li>
<li>… It also makes the code easier to read; the <code>last()</code> trick for
<code>fn:foot</code> is harder to understand and harder to optimize.</li>
</ul></li>
<li>JK: They’ll be great functions to have, I’m just thinking of the
larger question of the “cluttering” of the core specs with
convenience functions.</li>
</ul>

<p>
NW observes that the question of <a href="https://github.com/qt4cg/qtspecs/issues/274">issue #274</a> isn’t on the agenda this
week, maybe it should be next week.
</p>

<ul class="org-ul">
<li>RD: One of the arguments against convenience functions is that it
makes more work for implementors to claim conformance.
<ul class="org-ul">
<li>… I wonder if it would make sense to have a reference
implementation for as many as we can, perhaps non-normatively.</li>
</ul></li>
<li>EP: I was going to make exactly that point.</li>
<li>MSM: These functions do have those expressions.</li>
<li>RD: So we could pull that into a single place, grouped by XQuery and
XSLT style.</li>
<li>MSM: A library that an implementation could just import.</li>
<li>DN: If the question is asked about <code>fn:head</code> and <code>fn:tail</code>, I don’t
think they’re convenience functions at all! They’re the basics for
any recursive implementation. And that holds true for these
functions as well as they’re the complement of those functions.
<ul class="org-ul">
<li>… I am still firmly agains the name <code>fn:truncate</code>.</li>
<li>… I also don’t like the difference in behavior between the array
and sequence versions. I proposed that for the sequence functions,
we have an additional parameter that says whether an exception
should be raised for an empty argument. The default value should
be <code>false()</code>, but a user who wants them to behave the same as
arrays can set them to <code>true()</code>.</li>
</ul></li>
<li>RD: An extra argument to control exception behavior isn’t a great
design decision. It pollutes the argument namespace. It would
make more sense to use something like the XQuery declare options.</li>
<li>MK: A mode like “unordered”. Make it part of the static context.</li>
<li>CG: Whenever you work with arrays, you always have out-of-bounds
issues, we shouldn’t restrict it to just these functions.</li>
<li>DN: There’s no way to make an array behave like a sequence. An array
can contain an empty sequence and that makes the cases
indistinguishable.</li>
<li>RD: Then what happens if you’re writing the function and you have
one case where you’ve remembered to include that parameter and
another where you’ve forgotten it. Your code is expecting it to
throw, but because you left it out, it doens’t. That’s my objection
to having this as a parameter on each of the non-array functions.</li>
<li>DN: I think this is completely new behavior, but you’re right, you
have to specify it in every call.</li>
<li>RD: Having it at the global level would allow you to have more
consistent control, so you don’t have to remember to pass the specific parameter.</li>
<li>DN: But there could be cases where I want them to work both ways.</li>
<li>RD: But by extension, why not parameters on every function?</li>
<li>CG: We should separate this discussion from these four functions,
they apply much more widely.</li>
</ul>

<p>
Some discussion of what other functions have this behavior.
</p>

<ul class="org-ul">
<li>NW: Why not wrap the function you want to check in another function
that checks?</li>
<li>MSM: That has the value of being shorter and easier to remember.</li>

<li>MK: What are the possible solutions?
<ul class="org-ul">
<li>Do nothing, leave it up to the user; try/catch</li>
<li>Add parameters to the functions</li>
<li>Provide mirror versions of the functions</li>
<li>Make it modal</li>
</ul></li>

<li>DN: Try/catch is the least practical</li>
<li>MM: My choice is the proposal as it’s designed: sequences are designed to be relaxed, arrays are for stronger type hecking. That inconsist</li>
</ul>

<p>
ACTION QT4CG-013-03: MK to raise a separate issue about sequence/array out-of-bounds handling
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
